README.org
*** [[http://gtsam.org/][GTSAM]]
GTSAM is a BSD-licensed C++ library that implements sensor fusion for
robotics and computer vision applications, including SLAM (Simultaneous
Localization and Mapping), VO (Visual Odometry), and SFM (Structure from
Motion). It uses factor graphs and Bayes networks as the underlying computing
paradigm rather than sparse matrices to optimize for the most probable
configuration or an optimal plan. Coupled with a capable sensor front-end (not
provided here), GTSAM powers many impressive autonomous systems, in both
academia and industry.
*** [[https://github.com/WBK-Robotics/pybullet_industrial][pybullet Industrial]]
~Pybullet_industrial~ is a process-aware robot simulation. It aims to enable
scientists and researchers to easily simulate robotics scenarios where a robot
is participating in a manufacturing process. It achieves this by combining the
world of classical robot simulations with the world of industrial processes. The
library is capable of simulating different manufacturing tools and workpieces,
as well as the robot itself. With the help of the pybullet_industrial package
you will be able to:

+ simulate additive manufacturing processes
+ simulate milling processes and how the resulting forces impact the robot
+ simulating paint coating scenarios
+ simulate the handling of complex tasks using a variety of grippers

* Hardware
** [[https://www.stereolabs.com/][Stereo cameras from STEREOLabs.]]
** [[https://www.dji.com/de/robomaster-s1][Robomaster S1 can be used as a robotic education kit.]]
** [[https://apps.boschrexroth.com/microsites/ctrlx-automation/en/][ctrlX automation]]

* Methods
** 2-layer launch
Instead of a launch file structure of multiple layers, it is suggested by Ingo
Lütkebohle from BOSCH to have a 2-layer launch files
  - system launch
  - subsystem launches
This seems to have increased their productivity when dealing with launch files.
** [[https://testsigma.com/blog/agile-testing-quadrants/][Agile Test Quadrants]]
Agile Testing Quadrants are a practical tool for sorting testing types into four
categories. They help testers decide what to test and how to do it, considering
exhaustive testing is impossible.
** Motion planning combining Hybrid A* and Dubins/Reeds-shepp curves
+ [[https://github.com/karlkurzer/path_planner][Hybrid A*]]
+ [[https://modernrobotics.northwestern.edu/nu-gm-book-resource/13-3-3-motion-planning-for-nonholonomic-mobile-robots/][Dubins/Reeds-shepp curves]]
** Create own collision meshes when autogenerated model by ISacc Sim is not optimal

* Standard
** ROS [[https://ros.org/reps/rep-2004.html][REP 2004]] - Package Quality Categrories
This REP describes a set of categories meant to convey the quality or maturity
of packages in the ROS ecosystem. Inclusion in a category, or quality level, is
based on the policies to which a package adheres. The categories address
policies about versioning, change control, documentation, testing, dependencies,
platform support and security.

** [[https://iso25000.com/index.php/en/iso-25000-standards/iso-25010][ISO-25010]] Software Porduct Quality
Often also useful for resolving different opinions in team.

* Unsorted
** "Reproducibility Safety": Make sure the binary is not being tempered after being built from the source
** Watch out for sensor timestamping instead of using Time::now() blindly
Monitor for determinism. how old are the data when being used
** ROS-ROS2 bridge is unreliable in production and "macht nur Ärger".
** BOSCH mit ROS, bzw. micro-ROS ab 2014
** Unique components -> Closed source. Others -> open source.
** Pay attention to implicit patent liscence when releasing open source software
** ISaac Sim Omnigraph
** ROS bei AGCO seit 10 Jahren

* To be merged
** 09:08 helyOS - Das Open-Source-Framework für Leitstände für mobile Roboter
+ [X] helyOS: github.com/FraunhoferIVI
** 09:23 ROSbloX: Schnelleinstieg in hochwertige ROS-Robotik ohne Vorkenntnisse
+ [ ] ROSbloX: building blocks for Einstieg in Roboter
+ [ ] Ethernet over USB
+ [ ] foxglove Studio server
+ [ ] roslibpy: connecting to rosbridge

** 09:42 Jenseits von RRTConnect: Plannerwahl in Moveit2
+ [ ] Planners
  - OMPL: library for sampling-based planning
  - CHOMP: Covariant Hamiltonian Optimization for Motion Planning
  - STOMP: Stochastic Trajectory Optimization for Mtion Planning
  - PILZ Industrial Motion Planner
  - See the photo for a summary
+ [ ] Parallel planning with all planners: it will though not be better als the best single planner.
+ [ ] MoveIt Studio
** 10:15 ROS-2 communication optimization using Zenoh ROS 2 Bridge
+ [ ] Zenoh selected as the first non DDS protocol to be natively supported
+ [ ] Intrinsic implementing Zenoh RMWas the major contribution for ROS2 2024 release
+ [ ] Zenoh supports any topology: peer to peer, brokered, routed
+ [ ] Check: MQTT
+ [ ] Repo zenoh-plugin-ros2dds
** 10:45 CI/CD Tools for Scaling of AMR Software Rollouts
+ [ ] Firma: Node Robotics
+ [ ] Check their gitlab repos. It seems that the projects are still closed-source.
** 11:45 Integration der ETSI ITS Nachrichten für V2X-Kommunikation in ROS
** 12:07 Intel Robotics SDK for Industrial Applications
+ [ ] Check: Intel Robotics SDK intel.com/robotics
+ [ ] Check: openvino (AI inference engine)
+ [ ] Check: OneAPI
+ [ ] Check Intel edge software community amrdocs.intel.com
** 12:23 Lightning talk
*** ROS: Nicht nur für Roboter, sondern auch für Rucksäcker im Wald
Pointcloud of forest is taken with camera on the Rucksack..
*** cobot hub
+ cobothub.de
+ plattform unabhängig.
+ Decouple hardware from software
*** Effiziente Segmentierung von 3D-Punktwolken (intel)
*** Scenario-Execution: repeatable test scenarios. Not yet open source.
*** ros-nvim
*** filics: cool small AGVs for forklifter without forklifter
+ Use webots for simulation
*** roslaunch mit mehr als einem roboter
*** Eurobot - wettbewerb
*** ros_license_toolkit: github.com/boschresearch/ros_license_toolkit
*** Delibration working group
+ groups.google.com/g/ros-wg-deliberation
+ github: Awesome ros Deliberation
*** Deleh/gis: Status summary of multiple git repositories
*** Automated and Connected Driving challenges (ACDC)
On github.
** 14:00 Lernen
** 11:15 Unter der Oberfläche: Die ROS-Entwicklung bei Cellumation
Transport von Fördergut
+ [ ] Port zu ROS2
+ [ ] Own node lifecyle management
+ [ ] ROS2 does not support the array of paramter anymore
+ [ ] Cost of the Port: 6PM
  - 1 PM nur bugs finden und fixen in rclcpp etc.
  - 0.5 PM fastDDS
+ [ ] Unexpected problem: siehe bilder
+ [ ] The good: siehe bilder
+ [ ] Fazit: siehe bilder
** 11:45 Integration der ETSI ITS Nachrichten für V2X-Kommunikation in ROS
** 12:07 Intel Robotics SDK for Industrial Applications
+ [ ] Check: Intel Robotics SDK intel.com/robotics
+ [ ] Check: openvino (AI inference engine)
+ [ ] Check: OneAPI
+ [ ] Check Intel edge software community amrdocs.intel.com
** 12:23 Lightning talk
*** ROS: Nicht nur für Roboter, sondern auch für Rucksäcker im Wald
Pointcloud of forest is taken with camera on the Rucksack..
*** cobot hub
+ cobothub.de
+ plattform unabhängig.
+ Decouple hardware from software
*** Effiziente Segmentierung von 3D-Punktwolken (intel)
*** Scenario-Execution: repeatable test scenarios. Not yet open source.
*** ros-nvim
*** filics: cool small AGVs for forklifter without forklifter
+ Use webots for simulation
*** roslaunch mit mehr als einem roboter
*** Eurobot - wettbewerb
*** ros_license_toolkit: github.com/boschresearch/ros_license_toolkit
*** Delibration working group
+ groups.google.com/g/ros-wg-deliberation
+ github: Awesome ros Deliberation
*** Deleh/gis: Status summary of multiple git repositories
*** Automated and Connected Driving challenges (ACDC)
On github.
